{% comment %}
This Source Code Form is subject to the terms of the Mozilla Public
License, v. 2.0. If a copy of the MPL was not distributed with this
file, You can obtain one at http://mozilla.org/MPL/2.0/.
{% endcomment %}
[
  {
    "comment": "This is a tracker bug for releasing Firefox Mobile {{ loc }}.\n\nThis bug is not that detailed, but as we get particular work items, they should\nblock this bug for tracking and discoverability.", 
    "product": "Mozilla Localizations", 
    "title": "shipping", 
    "cc": "{{ bugmail }},l10n@mozilla.com,francesco.lodolo@gmail.com,lebedel.delphine@gmail.com", 
    "rep_platform": "All", 
    "short_desc": "[{{ loc }}] Firefox Mobile release tracker {{ language }}", 
    "component": "{{ component }}", 
    "alias": "fm-l10n-{{ loc }}", 
    "op_sys": "All", 
    "blocked": "fm-l10n-tracker"
  }, 
  {
    "comment": "We want to ship Firefox Mobile with a good list of search engines for {{ language }}. \n\nWe're going to work towards this in three phases. First, the localization team and the l10n drivers will look at the market for the language and come up with a good set of search providers. {{ name }}, we'll need your input on this, the guidelines for making recommendations are on <https://wiki.mozilla.org/L10n:Mobile/Productization>. \n\nFor en-US, we currently use this set, to which we can fall back in the case of lacking localized alternatives:\n\n> Google, Yahoo, Bing, Amazon, Twitter, Wikipedia\n\nWe may also want to go with just a subset of the en-US engines, if that's more appropriate for the local market.\n\nAdding brand new search engines, that don't yet ship in any other language, needs approval from Business Development and requires more time to get authorization and assets from the provider. To avoid blocking the initial set up, this type of requests should be split into follow up bugs. {{ name }}, we'll likely need your help to at least get the owner's contact information.\n\nFor search engines that we already ship with on desktop and that you would like to include in mobile as well, the permission is not needed.  Consider using a mobile version of the engine if one is available. For Android we'll want a specific 96x96px image, with colored background and rounder corners (6px radius).\n\nOnce we have a specification on what the search engines for {{ language }} should look like, Delphine and the localization team will work on the implementation. Delphine will create and attach patches for the desired changes and get them reviewed. After a successful review, Delphine will land them. {{ name }}, if you're interested, you could create the patches, too. You'd ask Delphine for review on those before landing. \n\nPlease don't commit any modifications in browser/searchplugins to the hg repository without a patch reviewed by Delphine, flod, Axel or someone else appointed by the l10n drivers. The data here is sensitive to users and our search partners, thus the extra care here.\n\nThe {{ language }} team and Delphine will be driving this bug to completion.", 
    "product": "Mozilla Localizations", 
    "title": "search", 
    "cc": "l10n@mozilla.com,{{ bugmail }},francesco.lodolo@gmail.com,lebedel.delphine@gmail.com", 
    "rep_platform": "All", 
    "short_desc": "[{{ loc }}] Search engine setup for Firefox Mobile for {{ language }}.", 
    "component": "{{ component }}", 
    "bug_file_loc": "https://wiki.mozilla.org/L10n:Mobile/Productization", 
    "keywords": "productization", 
    "op_sys": "All", 
    "blocked": "fm-l10n-{{ loc }}"
  }
]
