{% comment %}
This Source Code Form is subject to the terms of the Mozilla Public
License, v. 2.0. If a copy of the MPL was not distributed with this
file, You can obtain one at http://mozilla.org/MPL/2.0/.
{% endcomment %}
[
  {
    "comment": "This is a tracker bug for releasing Firefox Mobile {{ loc }}.\n\nThis bug is not that detailed, but as we get particular work items, they should\nblock this bug for tracking and discoverability.", 
    "product": "Mozilla Localizations", 
    "title": "shipping", 
    "cc": "{{ bugmail }},l10n@mozilla.com,stas@moz,pascalc@gmail,milos@moz", 
    "rep_platform": "All", 
    "short_desc": "[{{ loc }}] Firefox Mobile release tracker {{ language }}", 
    "component": "{{ component }}", 
    "alias": "fm-l10n-{{ loc }}", 
    "op_sys": "All", 
    "blocked": "fm-l10n-tracker"
  }, 
  {
    "comment": "We want to ship Firefox Mobile with a good list of search engines for {{ language }}. \n\nWe're going to work towards this in three phases. First, the localization team and the l10n drivers will look at the market for the language and come up with a good set of search providers. {{ name }}, we'll need your input on this, the guidelines for making recommendations are on <https://wiki.mozilla.org/L10n:Mobile/Productization>. \n\nFor en-US, we currently use this set, to which we can fall back in the case of lacking localized alternatives:\n\n> Google (mobile version), Amazon, Twitter, Wikipedia (slightly different to desktop, 32x32 icon)\n\nOnce we decide to use a particular search engine (and we test it on a mobile device), l10n drivers will contact the owner and ask for permission, and for specifics like proper search flags. {{ name }}, we'll likely need your help to at least get the contact information.\n\nFor search engines that we already ship with on desktop and that you would like to include in mobile as well, the permission is not needed.  Consider using a mobile version of the engine if one is available.  Also, please make yourself familiar with instructions regarding the <Description/> element at <https://wiki.mozilla.org/L10n:Integrated_Search_Instructions>.\n\nOnce we have a specification on what the search engines for {{ language }} should look like, Milos and the localization team will work on an implementation on that. Milos will create and attach patches for the desired changes and get them reviewed. After a successful review, Milos will land them. {{ name }}, if you're interested, you could create the patches, too. You'd ask Milos for review on those before landing. \n\nPlease don't commit any modifications in browser/searchplugins to the hg repository without a patch reviewed by Milos, Stas, Axel or someone else appointed by the l10n drivers. The data here is sensitive to users and our search partners, thus the extra care here.\n\nThe {{ language }} team and Milos will be driving this bug to completion.", 
    "product": "Mozilla Localizations", 
    "title": "search", 
    "cc": "l10n@mozilla.com,stas@moz,{{ bugmail }},milos@moz", 
    "rep_platform": "All", 
    "short_desc": "[{{ loc }}] Search engine setup for Firefox Mobile for {{ language }}.", 
    "component": "{{ component }}", 
    "bug_file_loc": "https://wiki.mozilla.org/L10n:Mobile/Productization", 
    "keywords": "productization", 
    "op_sys": "All", 
    "blocked": "fm-l10n-{{ loc }}"
  }
]
