{% comment %}
***** BEGIN LICENSE BLOCK *****
Version: MPL 1.1/GPL 2.0/LGPL 2.1

The contents of this file are subject to the Mozilla Public License Version 
1.1 (the "License"); you may not use this file except in compliance with 
the License. You may obtain a copy of the License at 
http://www.mozilla.org/MPL/

Software distributed under the License is distributed on an "AS IS" basis,
WITHOUT WARRANTY OF ANY KIND, either express or implied. See the License
for the specific language governing rights and limitations under the
License.

The Original Code is l10n django site.

The Initial Developer of the Original Code is
Mozilla Foundation.
Portions created by the Initial Developer are Copyright (C) 2011
the Initial Developer. All Rights Reserved.

Contributor(s):

Alternatively, the contents of this file may be used under the terms of
either the GNU General Public License Version 2 or later (the "GPL"), or
the GNU Lesser General Public License Version 2.1 or later (the "LGPL"),
in which case the provisions of the GPL or the LGPL are applicable instead
of those above. If you wish to allow use of your version of this file only
under the terms of either the GPL or the LGPL, and not to allow others to
use your version of this file under the terms of the MPL, indicate your
decision by deleting the provisions above and replace them with the notice
and other provisions required by the GPL or the LGPL. If you do not delete
the provisions above, a recipient may use your version of this file under
the terms of any one of the MPL, the GPL or the LGPL.

***** END LICENSE BLOCK *****
{% endcomment %}
[
  {
    "comment": "This is a tracker bug for releasing Firefox Mobile {{ loc }}.\n\nThis bug is not that detailed, but as we get particular work items, they should\nblock this bug for tracking and discoverability.", 
    "product": "Mozilla Localizations", 
    "title": "shipping", 
    "cc": "{{ bugmail }},l10n@mozilla.com,stas@moz,pascalc@gmail,milos@moz", 
    "rep_platform": "All", 
    "short_desc": "[{{ loc }}] Firefox Mobile release tracker {{ language }}", 
    "component": "{{ component }}", 
    "alias": "fm-l10n-{{ loc }}", 
    "op_sys": "All", 
    "blocked": "fm-l10n-tracker"
  }, 
  {
    "comment": "We want to ship Firefox Mobile with a good list of search engines for {{ language }}. \n\nWe're going to work towards this in three phases. First, the localization team and the l10n drivers will look at the market for the language and come up with a good set of search providers. {{ name }}, we'll need your input on this, the guidelines for making recommendations are on <https://wiki.mozilla.org/L10n:Mobile/Productization>. \n\nFor en-US, we currently use this set, to which we can fall back in the case of lacking localized alternatives:\n\n> Google (mobile version), Amazon, Twitter, Wikipedia (mobile version)\n\nOnce we decide to use a particular search engine (and we test it on a mobile device), l10n drivers will contact the owner and ask for permission, and for specifics like proper search flags. {{ name }}, we'll likely need your help to at least get the contact information.\n\nFor search engines that we already ship with on desktop and that you would like to include in mobile as well, the permission is not needed.  Consider using a mobile version of the engine if one is available.  Also, please make yourself familiar with instructions regarding the <Description/> element at <https://wiki.mozilla.org/L10n:Integrated_Search_Instructions>.\n\nFinally, once we have a specification on what the search engines for {{ language }} should look like, the localization team and the l10n drivers will work on the implementation. This should happen by the localization team creating and attaching patches for the desired changes, and requesting review from milos@moz. After a successful review, the localization team will land them.\n\nPlease don't commit any modifications in browser/searchplugins to the hg repository without a patch reviewed by Milos, Stas, Axel or someone else appointed by the l10n drivers. The data here is sensitive to users and our search partners, thus the extra care here.\n\nThe {{ language }} team will be driving this bug to completion.", 
    "product": "Mozilla Localizations", 
    "title": "search", 
    "cc": "l10n@mozilla.com,stas@moz,{{ bugmail }},milos@moz", 
    "rep_platform": "All", 
    "short_desc": "[{{ loc }}] Search engine setup for Firefox Mobile for {{ language }}.", 
    "component": "{{ component }}", 
    "bug_file_loc": "https://wiki.mozilla.org/L10n:Mobile/Productization", 
    "keywords": "productization", 
    "op_sys": "All", 
    "blocked": "fm-l10n-{{ loc }}"
  }
]
